testAme/labs/lab4/combustor2D_highRe_highT/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-05;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
	    $p;
	    reltol	0;
    }

    "(U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "rho.*"
    {
	solver			diagonal;
	tolerance 		1e-9;
	relTol			0;
    }

    "h.*"
    {
	$U;
	tolerance 		1e-6;
	relTol			0;
    }
		
}

PIMPLE
{
	nCorrectors			1;
	nOuterCorrectors		50; 
	turbOnFinalIterOnly		no;
	nNonOrthogonalCorrectors	0;
	consistent			no;

	outerCorrectorResidualControl
	{
		"(U|k|epsilon|p|h|e)"
		{
			relTol		0;
			tolerance	1e-4;
		}
	}
}

relaxationFactors
{
	fields
	{
		"p.*"	0.3;
	}

	equations
       	{
        	"U.*"               	0.7;
       		"(k|epsilon).*"         0.5;
		"(h|e)"			0.5;
    	}
}


// ************************************************************************* //
